# DataFrame

## creating data frame

#### creating from list

In [4]:
import pandas as pd
list = ['a','b','c']
print(list)
df1 = pd.DataFrame(list)
print(df1)

['a', 'b', 'c']
   0
0  a
1  b
2  c

In [ ]:
df1 # it is same as print(df1) but it shows like arrange manner

   0
0  a
1  b
2  c

#### creating using list_of_list 

- when we create a data frame of more than one column and more than one index then we use list_of_lists

In [5]:
ls_of_ls = [[1,2,3],[4,5,6],[7,8,9]]
print(ls_of_ls)
df2 = pd.DataFrame(ls_of_ls)
df2

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

#### creating dataframe using dictionary

In [5]:
dict = {'ID':[1,2,3,4]}
print(dict)

{'ID': [1, 2, 3, 4]}

In [6]:
import pandas as pd 
dict_DataFrame = pd.DataFrame(dict)
dict_DataFrame

   ID
0   1
1   2
2   3
3   4

#### creating using list of dictioanry 

- when we create a dataframe usnig dictionary more than one column and more than one index then we use list_of_dictionary

In [7]:
ls_dict = [
    {"name":'yash',"Age":21},
    {"name":'yastii',"Age":20}
]
ls_dict_dataframe = pd.DataFrame(ls_dict)
ls_dict_dataframe

     name  Age
0    yash   21
1  yastii   20

when two list of dictionary have two different value

In [8]:
ls_dict = [
    {"name":'yash',"Age":21},
    {"name":'yastii',"Age":20,"marks":90}
]
ls_dict_dataframe = pd.DataFrame(ls_dict)
ls_dict_dataframe

     name  Age  marks
0    yash   21    NaN
1  yastii   20   90.0

#### creating using dictionary of list

In [9]:
data = {
    "state":["ohio","ohio","ohio","nevada","nevada","nevada"],
    "year" :[2000,2001,2002,2001,2002,2003],
    "pop"  :[1.5,1.7,3.6,2.4,2.9,3.2]
}
frame = pd.DataFrame(data)
frame

    state  year  pop
0    ohio  2000  1.5
1    ohio  2001  1.7
2    ohio  2002  3.6
3  nevada  2001  2.4
4  nevada  2002  2.9
5  nevada  2003  3.2

#### creating using dictionary of series

In [10]:
dict_s = {'ID':pd.Series([1,2,3]),'SN':[111,222,333]}
data_frame = pd.DataFrame(dict_s)
data_frame

   ID   SN
0   1  111
1   2  222
2   3  333